Repository: r7-labs/R7.News
Catalog: R7.News.Stream/App_LocalResources/EditNewsEntry.ascx.*.resx
Languages: ru_ru

# ModuleHelp.Text
source: <P>A R7.News.Stream module</P>
ru_ru: <P>Модуль R7.News.Stream</P>

# ControlTitle_edit.Text
source: Edit news entry
ru_ru: Редактировать новость

# NotSelected.Text
source: < Not Selected >
ru_ru: < Не выбрано >

# Add.Text
source: Add
ru_ru: Добавить

# Update.Text
source: Update
ru_ru: Сохранить

# labelTitle.Text
source: Title:
ru_ru: Заголовок:

# labelTitle.Help
source: Enter the title for news entry.
ru_ru: Введите заголовок новости.

# Title.Required
source: Please enter news title.
ru_ru: Пожалуйста, введите заголовок новости.

# Title.MaxLength
source: The length of Title field must be 255 characters or less.
ru_ru: Длина поля Заголовок не должна превышать 255 символов.

# labelDescription.Text
source: Description:
ru_ru: Описание:

# labelDescription.Help
source: Enter the short description for the news entry here.
ru_ru: Введите краткое описание новости.

# lblText.Text
source: Expanded Description:
ru_ru: Развернутое описание:

# lblText.Help
source: Enter the expanded description for the news entry here or leave it blank.
ru_ru: Введите развернутое описание новости или оставьте это поле пустым.

# labelThresholdDate.Text
source: Event Threshold Date:
ru_ru: Начало события:

# labelThresholdDate.Help
source: Enter event threshold date and time (possibly in the future).
ru_ru: Введите дату и время начала события (возможно, в будущем).

# labelDueDate.Text
source: Event Due Date:
ru_ru: Окончание события:

# labelDueDate.Help
source: Enter event due date and time (possibly in the future).
ru_ru: Введите дату и время окончания события (возможно, в будущем).

# labelStartDate.Text
source: Start Publication:
ru_ru: Дата начала публикации:

# labelStartDate.Help
source: Enter the start date and time of publication for the news entry.
ru_ru: Введите датe начала публикации новости.

# labelEndDate.Text
source: End Publication:
ru_ru: Дата окончания публикации:

# labelEndDate.Help
source: Enter the end date and time of publication for the news entry.
ru_ru: Введите дату окончания публикации новости.

# labelTerms.Text
source: Terms:
ru_ru: Метки:

# labelTerms.Help
source: Select news entry terms.
ru_ru: Выберите метки для новости.

# labelImage.Text
source: Image:
ru_ru: Изображение:

# labelImage.Help
source: Select or upload main news image.
ru_ru: Выберите или подгрузите главное изображение новости.

# labelUrl.Text
source: Link:
ru_ru: Ссылка:

# labelUrl.Help
source: Provide URL to news details.
ru_ru: Укажите сслыку на подробное описание новости.

# labelThematicWeight.Text
source: Thematic Weight:
ru_ru: Тематический вес:

# labelThematicWeight.Help
source: Select news entry thematic weight. Using this value, each Stream module will decide to display (or not) the news entry according to the module thematic weight filter settings.
ru_ru: Выберите тематический вес новости. Используя это значение и настройки своего тематического фильтра, каждый модуль Stream может решить, следует ли отображать данную новость.

# labelStructuralWeight.Text
source: Structural Weight:
ru_ru: Структурный вес:

# labelStructuralWeight.Help
source: Select news entry structural weight. Using this value, each Stream module will decide to display (or not) the news entry according to the module structural weight filter settings.
ru_ru: Выберите структурный вес новости. Используя это значение и настройки своего структурного фильтра, каждый модуль Stream может решить, следует ли отображать данную новость.

# labelModules.Text
source: Modules:
ru_ru: Модули:

# labelModules.Help
source: Click "Get Modules" button to load list of Stream modules, in which news entry will be shown according to the selected terms and current thematic and structural weights.
ru_ru: Нажмите кнопку "Показать модули", чтобы загрузить список модулей Stream, в которых новость будет отображаться в зависимости от выбранных меток и текущих значений тематического и структурного весов.

# labelAudit.Text
source: Audit Data:
ru_ru: Данные аудита:

# labelAudit.Help
source: Audit data for the news entry.
ru_ru: Данные аудита новости.

# labelPermalinks.Text
source: Permalinks:
ru_ru: Постоянные ссылки:

# labelPermalinks.Help
source: You can copy permalinks for the news entry here.
ru_ru: Отсюда Вы можете скопировать постоянные ссылки на новость.

# lblAgentModule.Text
source: Agent Module Id:
ru_ru: Ид. модуля-агента:

# lblAgentModule.Help
source: Use this value to control news entry binding to the Agent module.
ru_ru: Используйте это значение, чтобы управлять привязкой новости к модулю новостного агента.

# buttonGetModules.Text
source: Get Modules
ru_ru: Показать модули

# btnDefaultImagesPath.Text
source: Default Images Path
ru_ru: Путь по умолчанию к изображениям

# Common.Tab
source: Common
ru_ru: Общие

# Text_Tab.Text
source: Expanded Description
ru_ru: Развернутое описание

# TermsAndWeights.Tab
source: Terms & Weights
ru_ru: Метки и веса

# Advanced.Tab
source: Advanced
ru_ru: Расширенные

# Audit.Tab
source: Audit
ru_ru: Аудит

# Module.Column
source: Module
ru_ru: Модуль

# PassesBy.Column
source: Passes by
ru_ru: Проходит по

# PassesByThematicWeight.Text
source: by thematic weight
ru_ru: по тематическому весу

# PassesByStructuralWeight.Text
source: by structural weight
ru_ru: по структурному весу

# PassesByShowAllSetting.Text
source: by "Show All" setting
ru_ru: по настройке "Показывать все"

# PassesByTerms.Text
source: by terms
ru_ru: по меткам

# labelDiscussionLink.Text
source: Discussion Link:
ru_ru: Ссылка на обсуждение:

# labelDiscussionLink.Help
source: You can copy link to news entry discussion here. Click "Clear Discussion Link" to clear binding between news entry and discussion. After that, the discussion can be removed safely.
ru_ru: Отсюда Вы можете скопировать ссылку на обсуждение новости. Нажмите "Удалить ссылку на обсуждение" для того, чтобы удалить связь новости с обсуждением. После этого, можно будет безопасно удалить обсуждение.

# buttonClearDiscussionLink.Text
source: Clear Discussion Link
ru_ru: Удалить ссылку на обсуждение

# CurrentPage.Text
source: Link to Current Page
ru_ru: Ссылка на текущую страницу
