Repository: r7-labs/R7.News
Catalog: R7.News.Stream/App_LocalResources/ModuleSettings.ascx.*.resx
Languages: ru_ru

# ControlTitle_settings.Text
source: News Stream Settings
ru_ru: Настройки ленты новостей

# ModuleHelp.Text
source: About R7.News.Stream Module Settings
ru_ru: О настройках модуля R7.News.Stream

# labelIncludeTerms.Text
source: Include Terms:
ru_ru: Показывать новости с метками:

# labelIncludeTerms.Help
source: Select the terms for news entries to display by the module.
ru_ru: Выберите метки новостей, которые будут отображаться данным модулем.

# labelShowAllNews.Text
source: Ignore Terms?
ru_ru: Не учитывать метки?

# labelShowAllNews.Help
source: If checked, module will show all site news, ignoring 'IncludeTerms' setting.
ru_ru: Если отмечено, модуль будет отображать все новости сайта, игнорируя настройку 'Показывать новости с метками'.

# labelThematicWeightFilter.Text
source: Thematic Weight Filter:
ru_ru: Фильтр тематического веса:

# labelThematicWeightFilter.Help
source: Select minimum and maximum value of news entries thematic weight range this module should display.
ru_ru: Выберите минимальное и максимальное значения диапазона для тематического веса новостей, отображаемых данным модулем.

# labelStructuralWeightFilter.Text
source: Structural Weight Filter:
ru_ru: Фильтр структурного веса:

# labelStructuralWeightFilter.Help
source: Select minimum and maximum value of news entries structural weight range this module should display.
ru_ru: Выберите минимальное и максимальное значения диапазона для структурного веса новостей, отображаемых данным модулем.

# labelThumbnailWidth.Text
source: Thumbnail Width:
ru_ru: Ширина миниатюры:

# labelThumbnailWidth.Help
source: Set width in px for generated thumbnail images.
ru_ru: Задайте ширину в пикселах генерируемых миниатюр изображений.

# ThumbnailWidth.Invalid
source: Thumbnail width must be an integer from 1 to 4096.
ru_ru: Ширина миниатюры должна быть целым числом от 1 до 4096.

# labelUseShowMore.Text
source: Use "Show More" button:
ru_ru: Использовать кнопку "Показать еще":

# labelUseShowMore.Help
source: Check to use "Show More" button instead of paging controls.
ru_ru: Отметьте, чтобы использовать кнопку "Показать еще" вместо переключателей страниц.

# labelShowTopPager.Text
source: Show Top Pager:
ru_ru: Переключатель страниц сверху:

# labelShowTopPager.Help
source: Check to show top paging control.
ru_ru: Отметьте, чтобы показать переключатель страниц сверху от списка новостей.

# labelShowBottomPager.Text
source: Show Bottom Pager:
ru_ru: Переключатель страниц внизу:

# labelShowBottomPager.Help
source: Check to show bottom paging control.
ru_ru: Отметьте, чтобы показать переключатель страниц снизу от списка новостей.

# labelPageSize.Text
source: Page Size:
ru_ru: Новостей на страницу:

# labelPageSize.Help
source: Set number of news entries displayed per one page.
ru_ru: Задайте количество новостей, отображаемых на одной странице.

# PageSize.Required
source: Page size is required.
ru_ru: Укажите количество новостей на страницу.

# PageSize.Invalid
source: Page size must be an integer between from 1 to 100.
ru_ru: Количество новостей на страницу должно быть целым числом от 1 до 100.

# labelMaxPageLinks.Text
source: Max. Page Links:
ru_ru: Макс. ссылок в переключателе:

# labelMaxPageLinks.Help
source: Set maximum number of page links in pager controls.
ru_ru: Задайте максимальное число ссылок на страницы в переключателе страниц.

# MaxPageLinks.Required
source: Maximum page links value is required.
ru_ru: Укажите максимальное число ссылок в переключателе страниц.

# MaxPageLinks.Invalid
source: Maximum page links value must be an integer between from 1 to 100.
ru_ru: Максимальное число ссылок в переключателе должно быть целым числом от 1 до 100.

# lblEnableFeed.Text
source: Enable Atom Feed?
ru_ru: Включить каналы Atom/RSS?

# lblEnableFeed.Help
source: Check to enable news stream export as the Atom feed.
ru_ru: Отметьте, чтобы включить экспорт новостной ленты в виде канала Atom или RSS.

# lblFeedMaxEntries.Text
source: Max. Entries:
ru_ru: Макс. новостей:

# lblFeedMaxEntries.Help
source: Enter maximum number of news entries to export as an Atom feed. You can leave this field empty, in this case the value of "feed.default-max-entries" option from the portal config will be used instead.
ru_ru: Введите максимальное количество новостей для экспорта в виде канала Atom или RSS. Если оставить поле пустым, вместо этого будет использоваться значение параметра "feed.default-max-entries" из конфигурации портала.

# lblImageCssClass.Text
source: Image CSS Class:
ru_ru: Класс CSS для изображений:

# lblTextCssClass.Text
source: Text CSS Class:
ru_ru: Класс CSS для текста новости:

# lblImageColumnCssClass.Text
source: Image Column CSS Class:
ru_ru: Класс CSS для колонки изображений:

# lblTextColumnCssClass.Text
source: Text Column CSS Class:
ru_ru: Класс CSS для колонки текста:

# lblPagerShowFirstLast.Text
source: Show First & Last Page Links?
ru_ru: Отображать ссылки на первую и последнюю страницы?

# lblPagerShowStatus.Text
source: Show Status Info?
ru_ru: Отображать состояние?

# sectionBasic.Text
source: Basic Settings
ru_ru: Основные настройки

# sectionAppearance.Text
source: Stream Appearance Settings
ru_ru: Настройки внешнего вида ленты новостей

# sectionPagination.Text
source: Pagination Settings
ru_ru: Настройки разбивки на страницы

# sectionFeed.Text
source: Atom Feed Settings
ru_ru: Настройки канала Atom/RSS
