Repository: r7-labs/R7.News
Catalog: R7.News.Agent/App_LocalResources/ModuleSettings.ascx.*.resx
Languages: ru_ru

# ControlTitle_settings.Text
source: R7.News.Agent Settings
ru_ru: Настройки R7.News.Agent

# ModuleHelp.Text
source: About R7.News.Agent Settings
ru_ru: О настройках R7.News.Agent

# NotSelected.Text
source: < Not Selected >
ru_ru: < Не выбрано >

# labelEnableGrouping.Text
source: Enable Grouping:
ru_ru: Включить группировку:

# labelEnableGrouping.Help
source: Grouping feature is obsolete, please avoid using it! Check to enable grouping of news related to this agent module.
ru_ru: Функция группировки устарела - пожалуйста, избегайте её использования! Отметьте, чтобы включить группировку новостей, относящихся к данному модулю.

# labelThumbnailWidth.Text
source: Thumbnail Width:
ru_ru: Ширина миниатюры:

# labelThumbnailWidth.Help
source: Set width in px for generated thumbnail images.
ru_ru: Задайте ширину в пикселах генерируемых миниатюр изображений.

# ThumbnailWidth.Invalid
source: Thumbnail width must be an integer from 1 to 4096.
ru_ru: Ширина миниатюры должна быть целым числом от 1 до 4096.

# labelGroupThumbnailWidth.Text
source: Thumbnail Width in Group:
ru_ru: Ширина миниатюры в группе:

# labelGroupThumbnailWidth.Help
source: Grouping feature is obsolete, please avoid using it! Set width in px for generated thumbnail images for grouped news entries.
ru_ru: Функция группировки устарела - пожалуйста, избегайте её использования! Задайте ширину в пикселах генерируемых миниатюр изображений для новостей в группе.

# GroupThumbnailWidth.Invalid
source: Thumbnail width in group must be an integer from 1 to 1024.
ru_ru: Ширина миниатюры в группе должна быть целым числом от 1 до 1024.

# labelGroupEntry.Text
source: Group Entry:
ru_ru: Новость для группировки:

# labelGroupEntry.Help
source: Grouping feature is obsolete, please avoid using it! Select the specific entry to group other entries around. If no entry selected, most recent one will be used.
ru_ru: Функция группировки устарела - пожалуйста, избегайте её использования! Выберите новость для группировки других новостей вокруг нее. Если такая новость не выбрана, группировка будет производиться вокруг наиболе свежей новости.

# lblImageCssClass.Text
source: Image CSS Class:
ru_ru: Класс CSS для изображений:

# lblTextCssClass.Text
source: Text CSS Class:
ru_ru: Класс CSS для текста новости:

# lblTopEntryTextCssClass.Text
source: Text CSS Class (Top News Entry):
ru_ru: Класс CSS для текста последней (верхней) новости:

# lblImageColumnCssClass.Text
source: Image Column CSS Class:
ru_ru: Класс CSS для колонки изображений:

# lblTextColumnCssClass.Text
source: Text Column CSS Class:
ru_ru: Класс CSS для колонки текста:

# sectionBasic.Text
source: Basic Settings
ru_ru: Основные настройки

# sectionAppearance.Text
source: Appearance Settings
ru_ru: Настройки внешнего вида
